'''5
115 Дано натуральное число n. Вычислить: "тут должна быть картинка"
'''
__autor__ = 'Райков'

from unit_115в import *

if __name__ == '__main__':

    print("введите n")
    n = int(input())

    print(f"результат = {logic(n):.3f}")
